In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame(np.ones((3,4)), index=list('ABC'), columns=list('efgh'))
df1

     e    f    g    h
A  1.0  1.0  1.0  1.0
B  1.0  1.0  1.0  1.0
C  1.0  1.0  1.0  1.0

In [3]:
df3 = pd.DataFrame([{'A':1,'B':2,'C':3,'D':4}, {'A':5,'B':6,'C':7,'D':8}])
df3

   A  B  C  D
0  1  2  3  4
1  5  6  7  8

In [5]:
df3 = pd.DataFrame([[1,2,3,4],[4,5,6,7],[8,9,10,11]], index=list('ABC'), columns=list('efgh'))
df3

   e  f   g   h
A  1  2   3   4
B  4  5   6   7
C  8  9  10  11

In [6]:
df3.iloc[0, :]

e    1
f    2
g    3
h    4
Name: A, dtype: int64

In [7]:
df3.iloc[:, 1]

A    2
B    5
C    9
Name: f, dtype: int64

In [9]:
df = pd.DataFrame([[1,2,3,4],[4,5,6,7],[8,9,10,11]],
                  index=list('ABC'), columns=list('efgh'))
df.loc["A"] = df.loc["C"]
df

   e  f   g   h
A  8  9  10  11
B  4  5   6   7
C  8  9  10  11

In [11]:
df.loc["D"] = df.loc["C"]
df

   e  f   g   h
A  8  9  10  11
B  4  5   6   7
C  8  9  10  11
D  8  9  10  11

In [13]:
df.loc[:,"Times 2"] = df.loc[:,"h"] * 2
df

   e  f   g   h  Times 2
A  8  9  10  11       22
B  4  5   6   7       14
C  8  9  10  11       22
D  8  9  10  11       22

In [18]:
df.loc["big", :] = (df.loc["A", :] > 4) | (df.loc["B"] > 6)
df

        e     f     g     h Times 2
A     8.0   9.0  10.0  11.0    22.0
B     4.0   5.0   6.0   7.0    14.0
C     8.0   9.0  10.0  11.0    22.0
D     8.0   9.0  10.0  11.0    22.0
big  True  True  True  True    True

In [21]:
df = pd.DataFrame([[4,5,6,7],[8,9,10,11],[1,2,3,4]],
                  index=list('ABC'), columns=list('efgh'))
df = df.sort_values(by="e", ascending=False)
df

   e  f   g   h
B  8  9  10  11
A  4  5   6   7
C  1  2   3   4

In [22]:
df = pd.DataFrame([[4,5,6,7],[8,9,10,11],[1,2,3,4]], 
                     index=list('ABC'), columns=list('efgh'))
df = df.drop("e", axis = 1)
df = df.drop(["A","B"], axis = 0)
df

   f  g  h
C  2  3  4